Управление_по_целям_и_KPI/src/Enums/KPI_РесурсыЦелевогоПоказателя/KPI_РесурсыЦелевогоПоказателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>KPI_РесурсыЦелевогоПоказателя</name>
  <enumValues>
    <name>Факт</name>
  </enumValues>
  <enumValues>
    <name>Вес</name>
  </enumValues>
  <enumValues>
    <name>План</name>
  </enumValues>
  <enumValues>
    <name>КПР</name>
  </enumValues>
  <enumValues>
    <name>ПроцентВыполнения</name>
  </enumValues>
</mdclass:Enum>

Управление_по_целям_и_KPI/src/Catalogs/KPI_КлючиАналитики/KPI_КлючиАналитики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>KPI_КлючиАналитики</name>
  <attributes>
    <name>Аналитика1</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика2</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика3</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика4</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика5</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Управление_по_целям_и_KPI/src/CommonModules/KPI_ИнтерфейсСерверПовтИсп/Module.bsl
//Функция получает значение ресурса с учетом матрицы распределения
//Параметры
// ПланФакты            - тип ТаблицаЗначений
// МатрицаРаспределения - тип СправочникСсылка.KPI_МатрицыРаспределения 
// ОтборПоказатели      - тип структура
//		Элементы:
//			ЦелевойПоказатель    - тип СправочникСсылка.KPI_ЦелевыеПоказатели,
//			Аналитика1           - тип произвольный,
//			Аналитика2           - тип произвольный,
//			Аналитика3           - тип произвольный,
//			Аналитика4           - тип произвольный,
//			Аналитика5           - тип произвольный,
// ТипРесурса           - тип строка (Представление ресурса (факт,вес и т.д.)
// Шкала                - тип СправочникСсылка.KPI_Шкала
//Возвращаемое значение
// ЗначениеШкалы        - тип число(значение ресурса по матрице распределения, с учетом интервалы шкалы)
Функция ЗначениеРесурсаМатрицыРаспределения(АдресПланФакты, МатрицаРаспределения, ОтборПоказатели, ТипРесурса, Шкала) Экспорт
	
	ЗначениеМатрицы = 0;
	ПланыФакты = ПолучитьИзВременногоХранилища(АдресПланФакты);
	
	Для Каждого Стр Из МатрицаРаспределения.Сотрудники Цикл
		
		ОтборПоказатели.Вставить("СтруктураКомпании", Стр.Сотрудник.СтруктураКомпании);
		
		СтрокиМатрицы = ПланыФакты.НайтиСтроки(ОтборПоказатели);
		Если ЗначениеЗаполнено(СтрокиМатрицы) Тогда
			ЗначениеПоВесу = СтрокиМатрицы[0][ТипРесурса] * Стр.Вес / 100;                                           
			ЗначениеМатрицы = ЗначениеМатрицы + ЗначениеПоВесу;                          
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеШкалы = Справочники.KPI_Шкалы.ЗначениеРесурсаЦелевогоПоказателяПоШкале(Шкала, ЗначениеМатрицы);
	
	Возврат ЗначениеШкалы;
	
КонецФункции

//Функция получает представление типа ресурса ЦелевогоПоказателя
//Параметры 
// ТипРесурса               - тип ПеречислениеСсылка.KPI_РесурсыЦелевогоПоказателя
//Возвращаемое значение
// ПредставлениеТипаРесурса - тип строка
Функция ПредставленияРесурсаЦелевогоПоказателя(ТипРесурса)  Экспорт
	
	ПредставленияРесурсаЦП  = Новый Соответствие;
	ПредставленияРесурсаЦП.Вставить(Перечисления.KPI_РесурсыЦелевогоПоказателя.Факт             , "Факт");
	ПредставленияРесурсаЦП.Вставить(Перечисления.KPI_РесурсыЦелевогоПоказателя.Вес              , "Вес");
	ПредставленияРесурсаЦП.Вставить(Перечисления.KPI_РесурсыЦелевогоПоказателя.КПР              , "КПР");
	ПредставленияРесурсаЦП.Вставить(Перечисления.KPI_РесурсыЦелевогоПоказателя.План             , "План");
	ПредставленияРесурсаЦП.Вставить(Перечисления.KPI_РесурсыЦелевогоПоказателя.ПроцентВыполнения, "ПроцентВыполнения");
	
	Возврат ПредставленияРесурсаЦП.Получить(ТипРесурса);
	
КонецФункции

//Функция получает КлючАналитики 
//Параметры
// Аналитика1, 				тип ЛюбаяСсылка, строка, число, дата, булево
// Аналитика2, 				тип ЛюбаяСсылка, строка, число, дата, булево
// Аналитика3, 				тип ЛюбаяСсылка, строка, число, дата, булево
// Аналитика4, 				тип ЛюбаяСсылка, строка, число, дата, булево
// Аналитика5, 				тип ЛюбаяСсылка, строка, число, дата, булево
//Возвращаемое значение
// СправочникСсылка.KPI_КлючиАналитики
Функция КлючАналитики (Аналитика1 = Неопределено, Аналитика2 = Неопределено, Аналитика3 = Неопределено, Аналитика4 = Неопределено, Аналитика5 = Неопределено) Экспорт
	
	КриптоМодуль = KPI_ОбщегоНазначенияСервер.ПолучитьКриптоМодуль();
	Возврат КриптоМодуль.КлючАналитики(Аналитика1, Аналитика2, Аналитика3, Аналитика4, Аналитика5);					   
	
КонецФункции

//Функция возвращает представление ключа аналитики
//Параметры:
// КлючАналитики - тип СправочникСсылка.КлючАналитики
//Возвращаемое значение:
// Представление ключа аналитики, тип строка
Функция ПредставлениеКлючаАналитики(КлючАналитики) Экспорт
	
	Возврат Справочники.KPI_КлючиАналитики.ПредставлениеКлючаАналитики(КлючАналитики);
	
КонецФункции
